# Задание 7
rezult_1 = float(input("Введите результат 1-го дня: "))
rezult_2 = float(input("Введите целевой результат: "))
n = 1 #счетчик дней
while rezult_1 <= rezult_2:
    rezult_1 *= 1.1
    n += 1
print("Спортсмен достиг целевого результата на ", n, "-й день")
